#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.5`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mtime_sleep.sleep_kusto_db["operationaldb"]: Refreshing state... [id=2024-08-26T15:40:23Z][0m
[0m[1mdata.azurerm_location.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_subscription.current: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg][0m
[0m[1mazurerm_resource_group.resource_group_dataeng: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00NDljMTk5OC1lYzgwLTQ4NmQtYjkwYi02MTRlZDFjMzE3Zjg7b2JqZWN0SWQ9Y2IxMTMzNjgtYWI0NC00YjU4LWI2NzgtYjA0Y2I5YWJhNDE3O3N1YnNjcmlwdGlvbklkPWJlMjU4MjBhLWRmODYtNDc5NC05ZTk1LTZhNDVjZDVjMDk0MTt0ZW5hbnRJZD01NzJjZjFlYy0zZjkwLTQ5YTItODk2Zi1hYjJmYTM2Y2EwZDM=][0m
[0m[1mdata.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941][0m
[0m[1mazurerm_storage_account.storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001][0m
[0m[1mazurerm_role_assignment.current_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/448f3f7f-7b18-f616-8c1b-5488c0778b4c][0m
[0m[1mazurerm_storage_container.storage_container["curated"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/curated][0m
[0m[1mazurerm_storage_container.storage_container["logs"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/logs][0m
[0m[1mazurerm_storage_container.storage_container["raw"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/raw][0m
[0m[1mazurerm_storage_container.storage_container["upload-ott"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-ott][0m
[0m[1mazurerm_storage_container.storage_container["upload-iptv"]: Refreshing state... [id=https://sc4devstg001.blob.core.windows.net/upload-iptv][0m
[0m[1mazurerm_role_assignment.current_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/3e667e9e-e5cd-e9aa-5ffc-6a8ec732e07e][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_storage: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001/providers/Microsoft.Authorization/roleAssignments/2d870d5d-7d26-094c-5b2e-640d63dd89ca][0m
[0m[1mazurerm_role_assignment.data_factory_role_assignment_key_vault: Refreshing state... [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001/providers/Microsoft.Authorization/roleAssignments/6e7ce4be-a4d9-edce-767a-9c5b27fb5ba7][0m
[0m[1mdata.azurerm_location.current: Read complete after 3s [id=/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/locations/germanywestcentral][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # azurerm_data_factory.data_factory[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_data_factory" "data_factory" {
      [31m-[0m[0m id                               = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.DataFactory/factories/sc4-dev-df001" [90m-> null[0m[0m
      [31m-[0m[0m name                             = "sc4-dev-df001" [90m-> null[0m[0m
        tags                             = {}
        [90m# (7 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m identity {
          [31m-[0m[0m principal_id = "e313c2df-2516-4c36-bfbf-0c1767de8018" [90m-> null[0m[0m
            [90m# (3 unchanged attributes hidden)[0m[0m
        }

        [90m# (7 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_key_vault.key_vault[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_key_vault" "key_vault" {
      [31m-[0m[0m id                              = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg/providers/Microsoft.KeyVault/vaults/sc4-dev-vault001" [90m-> null[0m[0m
        name                            = "sc4-dev-vault001"
        tags                            = {}
        [90m# (13 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azurerm_resource_group.resource_group_dataeng[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_resource_group" "resource_group_dataeng" {
        id         = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-dataeng-rg"
      [31m-[0m[0m name       = "sc4-dev-dataeng-rg" [90m-> null[0m[0m
        tags       = {}
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_resource_group.resource_group_storage[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_resource_group" "resource_group_storage" {
        id         = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg"
      [31m-[0m[0m name       = "sc4-dev-stg-rg" [90m-> null[0m[0m
        tags       = {}
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_storage_account.storage[0m has been deleted
[0m  [31m-[0m[0m resource "azurerm_storage_account" "storage" {
      [31m-[0m[0m id                                = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/resourceGroups/sc4-dev-stg-rg/providers/Microsoft.Storage/storageAccounts/sc4devstg001" [90m-> null[0m[0m
      [31m-[0m[0m name                              = "sc4devstg001" [90m-> null[0m[0m
        tags                              = {}
        [90m# (63 unchanged attributes hidden)[0m[0m

        [90m# (5 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_data_factory[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_data_factory" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_kusto_cluster[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_kusto_cluster" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # azurerm_data_factory.data_factory[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory" "data_factory" {
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "germanywestcentral"
      [32m+[0m[0m managed_virtual_network_enabled = true
      [32m+[0m[0m name                            = "sc4-dev-df001"
      [32m+[0m[0m public_network_enabled          = true
      [32m+[0m[0m resource_group_name             = "sc4-dev-dataeng-rg"

      [32m+[0m[0m github_configuration {
          [32m+[0m[0m account_name       = "PerfectThymeTech"
          [32m+[0m[0m branch_name        = "main"
          [32m+[0m[0m git_url            = "https://github.com"
          [32m+[0m[0m publishing_enabled = true
          [32m+[0m[0m repository_name    = "timeseries-data-explorer"
          [32m+[0m[0m root_folder        = "/code/datafactory"
        }

      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "happinessThreshold"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "0.8"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumLift"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "5.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumNumberOfUsersPerWindow"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "10.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumPlays"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "20.0"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "minimumUsersRatio"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "0.1"
        }
      [32m+[0m[0m global_parameter {
          [32m+[0m[0m name  = "movingWindowInMinutes"
          [32m+[0m[0m type  = "Float"
          [32m+[0m[0m value = "30.0"
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # azurerm_data_factory_managed_private_endpoint.data_factory_managed_private_endpoint_kusto_cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_data_factory_managed_private_endpoint" "data_factory_managed_private_endpoint_kusto_cluster" {
      [32m+[0m[0m data_factory_id    = (known after apply)
      [32m+[0m[0m fqdns              = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m name               = "AzureDataExplorer"
      [32m+[0m[0m subresource_name   = "cluster"
      [32m+[0m[0m target_resource_id = (known after apply)
    }

[1m  # azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "germanywestcentral"
      [32m+[0m[0m name                            = "sc4-dev-vault001"
      [32m+[0m[0m public_network_access_enabled   = true
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "sc4-dev-dataeng-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "572cf1ec-3f90-49a2-896f-ab2fa36ca0d3"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Allow"
        }
    }

[1m  # azurerm_kusto_cluster.kusto_cluster[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_cluster" "kusto_cluster" {
      [32m+[0m[0m allowed_fqdns                      = []
      [32m+[0m[0m allowed_ip_ranges                  = []
      [32m+[0m[0m auto_stop_enabled                  = false
      [32m+[0m[0m data_ingestion_uri                 = (known after apply)
      [32m+[0m[0m disk_encryption_enabled            = true
      [32m+[0m[0m double_encryption_enabled          = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m location                           = "germanywestcentral"
      [32m+[0m[0m name                               = "sc4-dev-kusto001"
      [32m+[0m[0m outbound_network_access_restricted = true
      [32m+[0m[0m public_ip_type                     = "IPv4"
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m purge_enabled                      = false
      [32m+[0m[0m resource_group_name                = "sc4-dev-dataeng-rg"
      [32m+[0m[0m streaming_ingestion_enabled        = false
      [32m+[0m[0m trusted_external_tenants           = []
      [32m+[0m[0m uri                                = (known after apply)
      [32m+[0m[0m zones                              = [
          [32m+[0m[0m "1",
          [32m+[0m[0m "2",
          [32m+[0m[0m "3",
        ]

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m language_extensions {
          [32m+[0m[0m image = "Python3_10_8"
          [32m+[0m[0m name  = "PYTHON"
        }

      [32m+[0m[0m sku {
          [32m+[0m[0m capacity = 2
          [32m+[0m[0m name     = "Standard_E2ads_v5"
        }
    }

[1m  # azurerm_kusto_database.kusto_database["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database" "kusto_database" {
      [32m+[0m[0m cluster_name        = "sc4-dev-kusto001"
      [32m+[0m[0m hot_cache_period    = "P7D"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "germanywestcentral"
      [32m+[0m[0m name                = "operationaldb"
      [32m+[0m[0m resource_group_name = "sc4-dev-dataeng-rg"
      [32m+[0m[0m size                = (known after apply)
      [32m+[0m[0m soft_delete_period  = "P31D"
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_admin["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_admin" {
      [32m+[0m[0m cluster_name        = "sc4-dev-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Admin-sc4-dev-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "sc4-dev-dataeng-rg"
      [32m+[0m[0m role                = "Admin"
      [32m+[0m[0m tenant_id           = "572cf1ec-3f90-49a2-896f-ab2fa36ca0d3"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_ingestor["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_ingestor" {
      [32m+[0m[0m cluster_name        = "sc4-dev-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Ingestor-sc4-dev-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "sc4-dev-dataeng-rg"
      [32m+[0m[0m role                = "Ingestor"
      [32m+[0m[0m tenant_id           = "572cf1ec-3f90-49a2-896f-ab2fa36ca0d3"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_database_principal_assignment.data_factory_kusto_database_principal_assignment_viewer["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_database_principal_assignment" "data_factory_kusto_database_principal_assignment_viewer" {
      [32m+[0m[0m cluster_name        = "sc4-dev-kusto001"
      [32m+[0m[0m database_name       = "operationaldb"
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "operationaldb-Viewer-sc4-dev-df001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m principal_name      = (known after apply)
      [32m+[0m[0m principal_type      = "App"
      [32m+[0m[0m resource_group_name = "sc4-dev-dataeng-rg"
      [32m+[0m[0m role                = "Viewer"
      [32m+[0m[0m tenant_id           = "572cf1ec-3f90-49a2-896f-ab2fa36ca0d3"
      [32m+[0m[0m tenant_name         = (known after apply)
    }

[1m  # azurerm_kusto_script.kusto_script["operationaldb"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_kusto_script" "kusto_script" {
      [32m+[0m[0m continue_on_errors_enabled         = false
      [32m+[0m[0m database_id                        = (known after apply)
      [32m+[0m[0m force_an_update_when_value_changed = "Ly8gQ3JlYXRlIHJhdyB0YWJsZXMKLmNyZWF0ZS1tZXJnZSB0YWJsZXMKICAgIG90dF9yYXcoCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIFNlcnZpY2U6IHN0cmluZywKICAgICAgICBTZXJ2aWNlVHlwZTogc3RyaW5nLAogICAgICAgIERldmljZTogc3RyaW5nLAogICAgICAgIFRpdGxlOiBzdHJpbmcsCiAgICAgICAgSXNwOiBzdHJpbmcsCiAgICAgICAgQ2RuSG9zdG5hbWU6IHN0cmluZywKICAgICAgICBDZG5Qb3A6IHN0cmluZywKICAgICAgICBBcHBSZWxlYXNlVmVyc2lvbjogc3RyaW5nLAogICAgICAgIEJyb3dzZXI6IHN0cmluZywKICAgICAgICBPczogc3RyaW5nLAogICAgICAgIFBsYXllcjogc3RyaW5nLAogICAgICAgIEhhcHBpbmVzc1Njb3JlOiByZWFsLAogICAgICAgIFVzZXJJZDogc3RyaW5nLAogICAgICAgIEVuZFRpbWU6IGRhdGV0aW1lLAogICAgICAgIEhhc2g6IHN0cmluZwogICAgKSwKICAgIGlwdHZfcmF3KAogICAgICAgIENvdW50cnk6IHN0cmluZywKICAgICAgICBTZXJ2aWNlOiBzdHJpbmcsCiAgICAgICAgU2VydmljZVR5cGU6IHN0cmluZywKICAgICAgICBUb3BvbG9neTI6IHN0cmluZywKICAgICAgICBUb3BvbG9neTM6IHN0cmluZywKICAgICAgICBUb3BvbG9neTQ6IHN0cmluZywKICAgICAgICBUb3BvbG9neTU6IHN0cmluZywKICAgICAgICBUaXRsZTogc3RyaW5nLAogICAgICAgIFN0Yk1vZGVsOiBzdHJpbmcsCiAgICAgICAgU3RiTWFudWZhY3R1cmVyOiBzdHJpbmcsCiAgICAgICAgU3RiU3dWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgU3RyZWFtaW5nUHJvdG9jb2w6IHN0cmluZywKICAgICAgICBDZG5Ib3N0bmFtZTogc3RyaW5nLAogICAgICAgIENkblBvcDogc3RyaW5nLAogICAgICAgIENoYW5uZWxOYW1lOiBzdHJpbmcsCiAgICAgICAgSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgVXNlcklkOiBzdHJpbmcsCiAgICAgICAgRW5kVGltZTogZGF0ZXRpbWUsCiAgICAgICAgSGFzaDogc3RyaW5nCiAgICApCgovLyBDcmVhdGUgY3VyYXRlZCB0YWJsZXMKLmNyZWF0ZS1tZXJnZSB0YWJsZXMKICAgIG90dF9oYXBwaW5lc3MoCiAgICAgICAgQ291bnRyeTogc3RyaW5nLAogICAgICAgIFNlcnZpY2U6IHN0cmluZywKICAgICAgICBTZXJ2aWNlVHlwZTogc3RyaW5nLAogICAgICAgIERldmljZTogc3RyaW5nLAogICAgICAgIFRpdGxlOiBzdHJpbmcsCiAgICAgICAgSXNwOiBzdHJpbmcsCiAgICAgICAgQ2RuSG9zdG5hbWU6IHN0cmluZywKICAgICAgICBDZG5Qb3A6IHN0cmluZywKICAgICAgICBBcHBSZWxlYXNlVmVyc2lvbjogc3RyaW5nLAogICAgICAgIEJyb3dzZXI6IHN0cmluZywKICAgICAgICBPczogc3RyaW5nLAogICAgICAgIFBsYXllcjogc3RyaW5nLAogICAgICAgIEF2Z0hhcHBpbmVzc1Njb3JlOiByZWFsLAogICAgICAgIE51bWJlck9mVXNlcnM6IGxvbmcsCiAgICAgICAgVGltZXN0YW1wOiBkYXRldGltZQogICAgKSwKICAgIGlwdHZfaGFwcGluZXNzKAogICAgICAgIENvdW50cnk6IHN0cmluZywKICAgICAgICBTZXJ2aWNlOiBzdHJpbmcsCiAgICAgICAgU2VydmljZVR5cGU6IHN0cmluZywKICAgICAgICBUb3BvbG9neTI6IHN0cmluZywKICAgICAgICBUb3BvbG9neTM6IHN0cmluZywKICAgICAgICBUb3BvbG9neTQ6IHN0cmluZywKICAgICAgICBUb3BvbG9neTU6IHN0cmluZywKICAgICAgICBUaXRsZTogc3RyaW5nLAogICAgICAgIFN0Yk1vZGVsOiBzdHJpbmcsCiAgICAgICAgU3RiTWFudWZhY3R1cmVyOiBzdHJpbmcsCiAgICAgICAgU3RiU3dWZXJzaW9uOiBzdHJpbmcsCiAgICAgICAgU3RyZWFtaW5nUHJvdG9jb2w6IHN0cmluZywKICAgICAgICBDZG5Ib3N0bmFtZTogc3RyaW5nLAogICAgICAgIENkblBvcDogc3RyaW5nLAogICAgICAgIENoYW5uZWxOYW1lOiBzdHJpbmcsCiAgICAgICAgQXZnSGFwcGluZXNzU2NvcmU6IHJlYWwsCiAgICAgICAgTnVtYmVyT2ZVc2VyczogbG9uZywKICAgICAgICBUaW1lc3RhbXA6IGRhdGV0aW1lCiAgICApCgovLyBDcmVhdGUgaGVscGVyIHRhYmxlcwouY3JlYXRlLW1lcmdlIHRhYmxlcwogICAgdGhyZXNob2xkcyAoCiAgICAgICAgbmFtZTogc3RyaW5nLAogICAgICAgIHZhbHVlOiByZWFsLAogICAgICAgIHRpbWVzdGFtcDogZGF0ZXRpbWUKICAgICkKCi8vIENyZWF0ZSBmdW5jdGlvbgouY3JlYXRlLW9yLWFsdGVyIGZ1bmN0aW9uIHdpdGggKGRvY3N0cmluZyA9ICdGdW5jdGlvbiB0byBnZXQgbGF0ZXN0IHRocmVzaG9sZCB2YWx1ZSBmb3IgbmFtZWQgdGhyZXNob2xkJywgZm9sZGVyPSd0aHJlc2hvbGRzJykgR2V0VGhyZXNob2xkKHZhbHVlTmFtZTogc3RyaW5nKSB7CiAgICB0b3NjYWxhcigKICAgICAgICB0aHJlc2hvbGRzCiAgICAgICAgfCB3aGVyZSBuYW1lID09IHZhbHVlTmFtZQogICAgICAgIHwgb3JkZXIgYnkgdGltZXN0YW1wIGRlc2MKICAgICAgICB8IGxpbWl0IDEKICAgICAgICB8IHN1bW1hcml6ZSBtYXgodmFsdWUpCiAgICApCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIGlwdHYgZGF0YScsIGZvbGRlcj0naXB0dicpIElwdHZHZXRBdmdIYXBwaW5lc3NTY29yZSgpIHsKICAgIGxldCBjdXJyZW50VGltZXN0YW1wID0gbm93KCk7CiAgICBsZXQgbW92aW5nV2luZG93SW5NaW51dGVzID0gR2V0VGhyZXNob2xkKCdtb3ZpbmdXaW5kb3dJbk1pbnV0ZXMnKTsKICAgIGlwdHZfcmF3CiAgICB8IHN1bW1hcml6ZQogICAgICAgIEF2Z0hhcHBpbmVzc1Njb3JlID0gYXZnKEhhcHBpbmVzc1Njb3JlKSwKICAgICAgICBOdW1iZXJPZlVzZXJzID0gZGNvdW50KFVzZXJJZCksCiAgICAgICAgVGltZXN0YW1wID0gY3VycmVudFRpbWVzdGFtcAogICAgICAgIGJ5CiAgICAgICAgQ291bnRyeSwKICAgICAgICBTZXJ2aWNlLAogICAgICAgIFNlcnZpY2VUeXBlLAogICAgICAgIFRvcG9sb2d5MiwKICAgICAgICBUb3BvbG9neTMsCiAgICAgICAgVG9wb2xvZ3k0LAogICAgICAgIFRvcG9sb2d5NSwKICAgICAgICBUaXRsZSwKICAgICAgICBTdGJNb2RlbCwKICAgICAgICBTdGJNYW51ZmFjdHVyZXIsCiAgICAgICAgU3RiU3dWZXJzaW9uLAogICAgICAgIFN0cmVhbWluZ1Byb3RvY29sLAogICAgICAgIENkbkhvc3RuYW1lLAogICAgICAgIENkblBvcCwKICAgICAgICBDaGFubmVsTmFtZQp9CgouY3JlYXRlLW9yLWFsdGVyIGZ1bmN0aW9uIHdpdGggKGRvY3N0cmluZyA9ICdGdW5jdGlvbiB0byBnZXQgYXZlcmFnZSBoYXBwaW5lc3Mgc2NvcmVzIGZvciBvdHQgZGF0YScsIGZvbGRlcj0nb3R0JykgT3R0R2V0QXZnSGFwcGluZXNzU2NvcmUoKSB7CiAgICBsZXQgY3VycmVudFRpbWVzdGFtcCA9IG5vdygpOwogICAgbGV0IG1vdmluZ1dpbmRvd0luTWludXRlcyA9IEdldFRocmVzaG9sZCgnbW92aW5nV2luZG93SW5NaW51dGVzJyk7CiAgICBvdHRfcmF3CiAgICB8IHN1bW1hcml6ZQogICAgICAgIEF2Z0hhcHBpbmVzc1Njb3JlID0gYXZnKEhhcHBpbmVzc1Njb3JlKSwKICAgICAgICBOdW1iZXJPZlVzZXJzID0gZGNvdW50KFVzZXJJZCksCiAgICAgICAgVGltZXN0YW1wID0gY3VycmVudFRpbWVzdGFtcAogICAgICAgIGJ5CiAgICAgICAgQ291bnRyeSwKICAgICAgICBTZXJ2aWNlLAogICAgICAgIFNlcnZpY2VUeXBlLAogICAgICAgIERldmljZSwKICAgICAgICBUaXRsZSwKICAgICAgICBJc3AsCiAgICAgICAgQ2RuSG9zdG5hbWUsCiAgICAgICAgQ2RuUG9wLAogICAgICAgIEFwcFJlbGVhc2VWZXJzaW9uLAogICAgICAgIEJyb3dzZXIsCiAgICAgICAgT3MsCiAgICAgICAgUGxheWVyCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIG90dCBkYXRhIGZvciBvbmUgY29sdW1uJywgZm9sZGVyPSdvdHQnKSBPdHRHZXRBdmdIYXBwaW5lc3NTY29yZUZvck9uZUNvbHVtbihjb2x1bW5OYW1lOiBzdHJpbmcpIHsKICAgIG90dF9oYXBwaW5lc3MKICAgIHwgZXh0ZW5kIFRvdGFsSGFwcGluZXNzID0gTnVtYmVyT2ZVc2VycyAqIEF2Z0hhcHBpbmVzc1Njb3JlCiAgICB8IHN1bW1hcml6ZQogICAgICAgIFN1bVRvdGFsSGFwcGluZXNzID0gc3VtKFRvdGFsSGFwcGluZXNzKSwKICAgICAgICBTdW1OdW1iZXJPZlVzZXJzID0gc3VtKE51bWJlck9mVXNlcnMpCiAgICAgICAgYnkKICAgICAgICBUaW1lc3RhbXAsCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUsICdjb2x1bW5OYW1lIGRvZXMgbm90IGV4aXN0JykKICAgIHwgZXh0ZW5kIEF2Z0hhcHBpbmVzc1Njb3JlID0gU3VtVG90YWxIYXBwaW5lc3MgLyBTdW1OdW1iZXJPZlVzZXJzCiAgICB8IHByb2plY3QtYXdheSBTdW1Ub3RhbEhhcHBpbmVzcwp9CgouY3JlYXRlLW9yLWFsdGVyIGZ1bmN0aW9uIHdpdGggKGRvY3N0cmluZyA9ICdGdW5jdGlvbiB0byBnZXQgYXZlcmFnZSBoYXBwaW5lc3Mgc2NvcmVzIGZvciBvdHQgZGF0YSBmb3IgdHdvIGNvbHVtbnMnLCBmb2xkZXI9J290dCcpIE90dEdldEF2Z0hhcHBpbmVzc1Njb3JlRm9yVHdvQ29sdW1ucyhjb2x1bW5OYW1lMTogc3RyaW5nLCBjb2x1bW5OYW1lMjogc3RyaW5nKSB7CiAgICBvdHRfaGFwcGluZXNzCiAgICB8IGV4dGVuZCBUb3RhbEhhcHBpbmVzcyA9IE51bWJlck9mVXNlcnMgKiBBdmdIYXBwaW5lc3NTY29yZQogICAgfCBzdW1tYXJpemUKICAgICAgICBTdW1Ub3RhbEhhcHBpbmVzcyA9IHN1bShUb3RhbEhhcHBpbmVzcyksCiAgICAgICAgU3VtTnVtYmVyT2ZVc2VycyA9IHN1bShOdW1iZXJPZlVzZXJzKQogICAgICAgIGJ5CiAgICAgICAgVGltZXN0YW1wLAogICAgICAgIGNvbHVtbl9pZmV4aXN0cyhjb2x1bW5OYW1lMSwgJ2NvbHVtbk5hbWUxIGRvZXMgbm90IGV4aXN0JyksCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUyLCAnY29sdW1uTmFtZTIgZG9lcyBub3QgZXhpc3QnKQogICAgfCBleHRlbmQgQXZnSGFwcGluZXNzU2NvcmUgPSBTdW1Ub3RhbEhhcHBpbmVzcyAvIFN1bU51bWJlck9mVXNlcnMKICAgIHwgcHJvamVjdC1hd2F5IFN1bVRvdGFsSGFwcGluZXNzCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAoZG9jc3RyaW5nID0gJ0Z1bmN0aW9uIHRvIGdldCBhdmVyYWdlIGhhcHBpbmVzcyBzY29yZXMgZm9yIGlwdHYgZGF0YSBmb3Igb25lIGNvbHVtbicsIGZvbGRlcj0naXB0dicpIElwdHZHZXRBdmdIYXBwaW5lc3NTY29yZUZvck9uZUNvbHVtbihjb2x1bW5OYW1lOiBzdHJpbmcpIHsKICAgIGlwdHZfaGFwcGluZXNzCiAgICB8IGV4dGVuZCBUb3RhbEhhcHBpbmVzcyA9IE51bWJlck9mVXNlcnMgKiBBdmdIYXBwaW5lc3NTY29yZQogICAgfCBzdW1tYXJpemUKICAgICAgICBTdW1Ub3RhbEhhcHBpbmVzcyA9IHN1bShUb3RhbEhhcHBpbmVzcyksCiAgICAgICAgU3VtTnVtYmVyT2ZVc2VycyA9IHN1bShOdW1iZXJPZlVzZXJzKQogICAgICAgIGJ5CiAgICAgICAgVGltZXN0YW1wLAogICAgICAgIGNvbHVtbl9pZmV4aXN0cyhjb2x1bW5OYW1lLCAnY29sdW1uTmFtZSBkb2VzIG5vdCBleGlzdCcpCiAgICB8IGV4dGVuZCBBdmdIYXBwaW5lc3NTY29yZSA9IFN1bVRvdGFsSGFwcGluZXNzIC8gU3VtTnVtYmVyT2ZVc2VycwogICAgfCBwcm9qZWN0LWF3YXkgU3VtVG90YWxIYXBwaW5lc3MKfQoKLmNyZWF0ZS1vci1hbHRlciBmdW5jdGlvbiB3aXRoIChkb2NzdHJpbmcgPSAnRnVuY3Rpb24gdG8gZ2V0IGF2ZXJhZ2UgaGFwcGluZXNzIHNjb3JlcyBmb3IgaXB0diBkYXRhIGZvciB0d28gY29sdW1ucycsIGZvbGRlcj0naXB0dicpIElwdHZHZXRBdmdIYXBwaW5lc3NTY29yZUZvclR3b0NvbHVtbnMoY29sdW1uTmFtZTE6IHN0cmluZywgY29sdW1uTmFtZTI6IHN0cmluZykgewogICAgaXB0dl9oYXBwaW5lc3MKICAgIHwgZXh0ZW5kIFRvdGFsSGFwcGluZXNzID0gTnVtYmVyT2ZVc2VycyAqIEF2Z0hhcHBpbmVzc1Njb3JlCiAgICB8IHN1bW1hcml6ZQogICAgICAgIFN1bVRvdGFsSGFwcGluZXNzID0gc3VtKFRvdGFsSGFwcGluZXNzKSwKICAgICAgICBTdW1OdW1iZXJPZlVzZXJzID0gc3VtKE51bWJlck9mVXNlcnMpCiAgICAgICAgYnkKICAgICAgICBUaW1lc3RhbXAsCiAgICAgICAgY29sdW1uX2lmZXhpc3RzKGNvbHVtbk5hbWUxLCAnY29sdW1uTmFtZTEgZG9lcyBub3QgZXhpc3QnKSwKICAgICAgICBjb2x1bW5faWZleGlzdHMoY29sdW1uTmFtZTIsICdjb2x1bW5OYW1lMiBkb2VzIG5vdCBleGlzdCcpCiAgICB8IGV4dGVuZCBBdmdIYXBwaW5lc3NTY29yZSA9IFN1bVRvdGFsSGFwcGluZXNzIC8gU3VtTnVtYmVyT2ZVc2VycwogICAgfCBwcm9qZWN0LWF3YXkgU3VtVG90YWxIYXBwaW5lc3MKfQoKLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vCi8vIENyZWF0ZSBtYXRlcmlhbGl6ZWQgdmlldyBhbmQgdmlldyBmb3IgdGVzdGluZwovLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8vLy8KCi8vIENyZWF0ZSBtYXRlcmFsaXplZCB2aWV3Ci5jcmVhdGUgaWZub3RleGlzdHMgbWF0ZXJpYWxpemVkLXZpZXcgd2l0aCAoZG9jU3RyaW5nPSdJUFRWIEhhcHBpbmVzcyBTY29yZSBBdmVyYWdlJywgZm9sZGVyPSdpcHR2JykgaXB0dl9oYXBwaW5lc3NfbXYgb24gdGFibGUgaXB0dl9yYXcgewogICAgaXB0dl9yYXcKICAgIHwgc3VtbWFyaXplCiAgICAgICAgQXZnSGFwcGluZXNzU2NvcmUgPSBhdmcoSGFwcGluZXNzU2NvcmUpLAogICAgICAgIE51bWJlck9mVXNlcnMgPSBkY291bnQoVXNlcklkKQogICAgICAgIGJ5CiAgICAgICAgQ291bnRyeSwKICAgICAgICBTZXJ2aWNlLAogICAgICAgIFNlcnZpY2VUeXBlLAogICAgICAgIFRvcG9sb2d5MiwKICAgICAgICBUb3BvbG9neTMsCiAgICAgICAgVG9wb2xvZ3k0LAogICAgICAgIFRvcG9sb2d5NSwKICAgICAgICBUaXRsZSwKICAgICAgICBTdGJNb2RlbCwKICAgICAgICBTdGJNYW51ZmFjdHVyZXIsCiAgICAgICAgU3RiU3dWZXJzaW9uLAogICAgICAgIFN0cmVhbWluZ1Byb3RvY29sLAogICAgICAgIENkbkhvc3RuYW1lLAogICAgICAgIENkblBvcCwKICAgICAgICBDaGFubmVsTmFtZQp9CgouY3JlYXRlIGlmbm90ZXhpc3RzIG1hdGVyaWFsaXplZC12aWV3IHdpdGggKGRvY1N0cmluZz0nT1RUIEhhcHBpbmVzcyBTY29yZSBBdmVyYWdlJywgZm9sZGVyPSdvdHQnKSBvdHRfaGFwcGluZXNzX212IG9uIHRhYmxlIG90dF9yYXcgewogICAgb3R0X3JhdwogICAgfCBzdW1tYXJpemUKICAgICAgICBBdmdIYXBwaW5lc3NTY29yZSA9IGF2ZyhIYXBwaW5lc3NTY29yZSksCiAgICAgICAgTnVtYmVyT2ZVc2VycyA9IGRjb3VudChVc2VySWQpCiAgICAgICAgYnkKICAgICAgICBDb3VudHJ5LAogICAgICAgIFNlcnZpY2UsCiAgICAgICAgU2VydmljZVR5cGUsCiAgICAgICAgRGV2aWNlLAogICAgICAgIFRpdGxlLAogICAgICAgIElzcCwKICAgICAgICBDZG5Ib3N0bmFtZSwKICAgICAgICBDZG5Qb3AsCiAgICAgICAgQXBwUmVsZWFzZVZlcnNpb24sCiAgICAgICAgQnJvd3NlciwKICAgICAgICBPcywKICAgICAgICBQbGF5ZXIKfQoKLy8gQ3JlYXRlIHZpZXdzCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAodmlldz10cnVlLCBkb2NzdHJpbmc9J1ZpZXcgdG8gY2FwdHVyZSBjcml0aWNhbCBpcHR2IGl0ZW1zIGJlbG93IHRoZSBoYXBwaW5lc3MgdGhyZXNob2xkJywgZm9sZGVyPSdpcHR2JykgaXB0dl9oYXBwaW5lc3NfY3JpdGljYWxfbXYgewogICAgaXB0dl9oYXBwaW5lc3NfbXYKICAgIHwgd2hlcmUgQXZnSGFwcGluZXNzU2NvcmUgPCBHZXRUaHJlc2hvbGQoJ2hhcHBpbmVzcycpIGFuZCBOdW1iZXJPZlVzZXJzID4gR2V0VGhyZXNob2xkKCdtaW5pbXVtTnVtYmVyT2ZVc2Vyc1BlcldpbmRvdycpCn0KCi5jcmVhdGUtb3ItYWx0ZXIgZnVuY3Rpb24gd2l0aCAodmlldz10cnVlLCBkb2NzdHJpbmc9J1ZpZXcgdG8gY2FwdHVyZSBjcml0aWNhbCBvdHQgaXRlbXMgYmVsb3cgdGhlIGhhcHBpbmVzcyB0aHJlc2hvbGQnLCBmb2xkZXI9J290dCcpIG90dF9oYXBwaW5lc3NfY3JpdGljYWxfbXYgewogICAgb3R0X2hhcHBpbmVzc19tdgogICAgfCB3aGVyZSBBdmdIYXBwaW5lc3NTY29yZSA8IEdldFRocmVzaG9sZCgnaGFwcGluZXNzJykgYW5kIE51bWJlck9mVXNlcnMgPiBHZXRUaHJlc2hvbGQoJ21pbmltdW1OdW1iZXJPZlVzZXJzUGVyV2luZG93JykKfQo="
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m name                               = "init-db-operationaldb"
      [32m+[0m[0m script_content                     = (sensitive value)
    }

[1m  # azurerm_resource_group.resource_group_dataeng[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_dataeng" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "germanywestcentral"
      [32m+[0m[0m name     = "sc4-dev-dataeng-rg"
    }

[1m  # azurerm_resource_group.resource_group_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group_storage" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "germanywestcentral"
      [32m+[0m[0m name     = "sc4-dev-stg-rg"
    }

[1m  # azurerm_role_assignment.current_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "cb113368-ab44-4b58-b678-b04cb9aba417"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.current_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_role_assignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "cb113368-ab44-4b58-b678-b04cb9aba417"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.data_factory_role_assignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_role_assignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_role_assignment.data_factory_role_assignment_storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "data_factory_role_assignment_storage" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # azurerm_storage_account.storage[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage" {
      [32m+[0m[0m access_tier                        = "Hot"
      [32m+[0m[0m account_kind                       = "StorageV2"
      [32m+[0m[0m account_replication_type           = "ZRS"
      [32m+[0m[0m account_tier                       = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public    = false
      [32m+[0m[0m allowed_copy_scope                 = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled   = false
      [32m+[0m[0m default_to_oauth_authentication    = true
      [32m+[0m[0m dns_endpoint_type                  = "Standard"
      [32m+[0m[0m https_traffic_only_enabled         = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled  = true
      [32m+[0m[0m is_hns_enabled                     = true
      [32m+[0m[0m large_file_share_enabled           = false
      [32m+[0m[0m local_user_enabled                 = true
      [32m+[0m[0m location                           = "germanywestcentral"
      [32m+[0m[0m min_tls_version                    = "TLS1_2"
      [32m+[0m[0m name                               = "sc4devstg001"
      [32m+[0m[0m nfsv3_enabled                      = false
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string     = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint              = (known after apply)
      [32m+[0m[0m primary_blob_host                  = (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_connection_string          = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint               = (known after apply)
      [32m+[0m[0m primary_dfs_host                   = (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [32m+[0m[0m primary_file_endpoint              = (known after apply)
      [32m+[0m[0m primary_file_host                  = (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_location                   = (known after apply)
      [32m+[0m[0m primary_queue_endpoint             = (known after apply)
      [32m+[0m[0m primary_queue_host                 = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_table_endpoint             = (known after apply)
      [32m+[0m[0m primary_table_host                 = (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_web_endpoint               = (known after apply)
      [32m+[0m[0m primary_web_host                   = (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [32m+[0m[0m public_network_access_enabled      = true
      [32m+[0m[0m queue_encryption_key_type          = "Account"
      [32m+[0m[0m resource_group_name                = "sc4-dev-stg-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [32m+[0m[0m sftp_enabled                       = false
      [32m+[0m[0m shared_access_key_enabled          = false
      [32m+[0m[0m table_encryption_key_type          = "Account"

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = "2020-06-12"
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days                     = 7
              [32m+[0m[0m permanent_delete_enabled = false
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "None",
            ]
          [32m+[0m[0m default_action             = "Allow"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)

          [32m+[0m[0m private_link_access {
              [32m+[0m[0m endpoint_resource_id = "/subscriptions/be25820a-df86-4794-9e95-6a45cd5c0941/providers/Microsoft.Security/datascanners/storageDataScanner"
              [32m+[0m[0m endpoint_tenant_id   = "572cf1ec-3f90-49a2-896f-ab2fa36ca0d3"
            }
        }

      [32m+[0m[0m queue_properties (known after apply)

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }

      [32m+[0m[0m share_properties (known after apply)
    }

[1m  # azurerm_storage_container.storage_container["curated"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "curated"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1m  # azurerm_storage_container.storage_container["logs"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "logs"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1m  # azurerm_storage_container.storage_container["raw"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "raw"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1m  # azurerm_storage_container.storage_container["upload-iptv"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "upload-iptv"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1m  # azurerm_storage_container.storage_container["upload-ott"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_container" "storage_container" {
      [32m+[0m[0m container_access_type             = "private"
      [32m+[0m[0m default_encryption_scope          = (known after apply)
      [32m+[0m[0m encryption_scope_override_enabled = true
      [32m+[0m[0m has_immutability_policy           = (known after apply)
      [32m+[0m[0m has_legal_hold                    = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m metadata                          = (known after apply)
      [32m+[0m[0m name                              = "upload-ott"
      [32m+[0m[0m resource_manager_id               = (known after apply)
      [32m+[0m[0m storage_account_name              = "sc4devstg001"
    }

[1mPlan:[0m 21 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>